# Mobile-friendly variant of YOLOv8n adapted for cvfoodid.
# Drop-in for ``ultralytics`` -- pass via ``YOLO("configs/yolov8n_food.yaml")``.

# Hyperparameters tuned for ~50 ingredient classes on Colab T4 (16 GB).
nc: 54  # number of classes -- must match data.yaml
depth_multiple: 0.33
width_multiple: 0.25

# The architecture itself is inherited from the upstream yolov8n.yaml. Define
# minimal training overrides here; pass the file as ``model=`` and use
# ``--cfg`` for advanced tweaks.
backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]
  - [[15, 18, 21], 1, Detect, [nc]]
